[
  {
    "title": "Your Name.",
    "id": 372058,
    "overview": "High schoolers Mitsuha and Taki are complete strangers living separate lives. But one night, they suddenly switch places. Mitsuha wakes up in Taki’s body, and he in hers. This bizarre occurrence continues to happen randomly, and the two must adjust their lives around each other.",
    "poster_path": "https://image.tmdb.org/t/p/w500/vfJFJPepRKapMd5G2ro7klIRysq.jpg",
    "release_date": "2016-08-26",
    "vote_average": 8.488,
    "Genre": "Animation"
  },
  {
    "title": "John Wick: Chapter 2",
    "id": 324552,
    "overview": "John Wick is forced out of retirement by a former associate looking to seize control of a shadowy international assassins’ guild. Bound by a blood oath to aid him, Wick travels to Rome and does battle against some of the world’s most dangerous killers.",
    "poster_path": "https://image.tmdb.org/t/p/w500/hXWBc0ioZP3cN4zCu6SN3YHXZVO.jpg",
    "release_date": "2017-02-08",
    "vote_average": 7.334,
    "Genre": "Action"
  },
  {
    "title": "12 Years a Slave",
    "id": 76203,
    "overview": "In the pre-Civil War United States, Solomon Northup, a free black man from upstate New York, is abducted and sold into slavery. Facing cruelty as well as unexpected kindnesses Solomon struggles not only to stay alive, but to retain his dignity. In the twelfth year of his unforgettable odyssey, Solomon’s chance meeting with a Canadian abolitionist will forever alter his life.",
    "poster_path": "https://image.tmdb.org/t/p/w500/xdANQijuNrJaw1HA61rDccME4Tm.jpg",
    "release_date": "2013-10-18",
    "vote_average": 7.942,
    "Genre": "Drama"
  },
  {
    "title": "Tropic Thunder",
    "id": 7446,
    "overview": "A group of self-absorbed actors set out to make the most expensive war film ever. After ballooning costs force the studio to cancel the movie, the frustrated director refuses to stop shooting, leading his cast into the jungles of Southeast Asia, where they encounter real bad guys.",
    "poster_path": "https://image.tmdb.org/t/p/w500/zAurB9mNxfYRoVrVjAJJwGV3sPg.jpg",
    "release_date": "2008-08-09",
    "vote_average": 6.678,
    "Genre": "Comedy"
  },
  {
    "title": "The Hobbit: An Unexpected Journey",
    "id": 49051,
    "overview": "Bilbo Baggins, a hobbit enjoying his quiet life, is swept into an epic quest by Gandalf the Grey and thirteen dwarves who seek to reclaim their mountain home from Smaug, the dragon.",
    "poster_path": "https://image.tmdb.org/t/p/w500/yHA9Fc37VmpUA5UncTxxo3rTGVA.jpg",
    "release_date": "2012-12-12",
    "vote_average": 7.357,
    "Genre": "Fantasy"
  },
  {
    "title": "Star Trek",
    "id": 13475,
    "overview": "The fate of the galaxy rests in the hands of bitter rivals. One, James Kirk, is a delinquent, thrill-seeking Iowa farm boy. The other, Spock, a Vulcan, was raised in a logic-based society that rejects all emotion. As fiery instinct clashes with calm reason, their unlikely but powerful partnership is the only thing capable of leading their crew through unimaginable danger, boldly going where no one has gone before. The human adventure has begun again.",
    "poster_path": "https://image.tmdb.org/t/p/w500/lV5OpzAss1z06YNagOVap1I35mH.jpg",
    "release_date": "2009-05-06",
    "vote_average": 7.429,
    "Genre": "Sci-fi"
  },
  {
    "title": "Weird: The Al Yankovic Story",
    "id": 928344,
    "overview": "Exploring every facet of ‘Weird Al’ Yankovic’s life, from his meteoric rise to fame with early hits like ‘Eat It’ and ‘Like a Surgeon’ to his torrid celebrity love affairs and famously depraved lifestyle, this biopic takes audiences on a truly unbelievable journey through Yankovic’s life and career, from gifted child prodigy to the greatest musical legend of all time.",
    "poster_path": "https://image.tmdb.org/t/p/w500/qcj2z13G0KjaIgc01ifiUKu7W07.jpg",
    "release_date": "2022-09-08",
    "vote_average": 6.678,
    "Genre": "Special"
  },
  {
    "title": "John Wick",
    "id": 245891,
    "overview": "Ex-hitman John Wick comes out of retirement to track down the gangsters that took everything from him.",
    "poster_path": "https://image.tmdb.org/t/p/w500/fZPSd91yGE9fCcCe6OoQr6E3Bev.jpg",
    "release_date": "2014-10-22",
    "vote_average": 7.436,
    "Genre": "Last Weeks Winner"
  }
]