[
  {
    "title": "Your Name.",
    "id": 372058,
    "overview": "High schoolers Mitsuha and Taki are complete strangers living separate lives. But one night, they suddenly switch places. Mitsuha wakes up in Taki’s body, and he in hers. This bizarre occurrence continues to happen randomly, and the two must adjust their lives around each other.",
    "poster_path": "https://image.tmdb.org/t/p/w500/vfJFJPepRKapMd5G2ro7klIRysq.jpg",
    "release_date": "2016-08-26",
    "vote_average": 8.488,
    "Genre": "Anime"
  },
  {
    "title": "Spider-Man: Into the Spider-Verse",
    "id": 324857,
    "overview": "Struggling to find his place in the world while juggling school and family, Brooklyn teenager Miles Morales is unexpectedly bitten by a radioactive spider and develops unfathomable powers just like the one and only Spider-Man. While wrestling with the implications of his new abilities, Miles discovers a super collider created by the madman Wilson \"Kingpin\" Fisk, causing others from across the Spider-Verse to be inadvertently transported to his dimension.",
    "poster_path": "https://image.tmdb.org/t/p/w500/iiZZdoQBEYBv6id8su7ImL0oCbD.jpg",
    "release_date": "2018-12-06",
    "vote_average": 8.401,
    "Genre": "Animation"
  },
  {
    "title": "John Wick",
    "id": 245891,
    "overview": "Ex-hitman John Wick comes out of retirement to track down the gangsters that took everything from him.",
    "poster_path": "https://image.tmdb.org/t/p/w500/fZPSd91yGE9fCcCe6OoQr6E3Bev.jpg",
    "release_date": "2014-10-22",
    "vote_average": 7.436,
    "Genre": "Action"
  },
  {
    "title": "12 Years a Slave",
    "id": 76203,
    "overview": "In the pre-Civil War United States, Solomon Northup, a free black man from upstate New York, is abducted and sold into slavery. Facing cruelty as well as unexpected kindnesses Solomon struggles not only to stay alive, but to retain his dignity. In the twelfth year of his unforgettable odyssey, Solomon’s chance meeting with a Canadian abolitionist will forever alter his life.",
    "poster_path": "https://image.tmdb.org/t/p/w500/xdANQijuNrJaw1HA61rDccME4Tm.jpg",
    "release_date": "2013-10-18",
    "vote_average": 7.942,
    "Genre": "Drama"
  },
  {
    "title": "Tropic Thunder",
    "id": 7446,
    "overview": "A group of self-absorbed actors set out to make the most expensive war film ever. After ballooning costs force the studio to cancel the movie, the frustrated director refuses to stop shooting, leading his cast into the jungles of Southeast Asia, where they encounter real bad guys.",
    "poster_path": "https://image.tmdb.org/t/p/w500/zAurB9mNxfYRoVrVjAJJwGV3sPg.jpg",
    "release_date": "2008-08-09",
    "vote_average": 6.678,
    "Genre": "Comedy"
  },
  {
    "title": "The Disaster Artist",
    "id": 371638,
    "overview": "An aspiring actor in Hollywood meets an enigmatic stranger by the name of Tommy Wiseau, the meeting leads the actor down a path nobody could have predicted; creating the worst movie ever made.",
    "poster_path": "https://image.tmdb.org/t/p/w500/jj84nF5vYRD0HUTowBKcrKk8hZP.jpg",
    "release_date": "2017-03-12",
    "vote_average": 7.113,
    "Genre": "Random"
  },
  {
    "title": "Weird: The Al Yankovic Story",
    "id": 928344,
    "overview": "Exploring every facet of ‘Weird Al’ Yankovic’s life, from his meteoric rise to fame with early hits like ‘Eat It’ and ‘Like a Surgeon’ to his torrid celebrity love affairs and famously depraved lifestyle, this biopic takes audiences on a truly unbelievable journey through Yankovic’s life and career, from gifted child prodigy to the greatest musical legend of all time.",
    "poster_path": "https://image.tmdb.org/t/p/w500/qcj2z13G0KjaIgc01ifiUKu7W07.jpg",
    "release_date": "2022-09-08",
    "vote_average": 6.678,
    "Genre": "Weird"
  },
  {
    "title": "The Nice Guys",
    "id": 290250,
    "overview": "A private eye investigates the apparent suicide of a fading porn star in 1970s Los Angeles and uncovers a conspiracy.",
    "poster_path": "https://image.tmdb.org/t/p/w500/clq4So9spa9cXk3MZy2iMdqkxP2.jpg",
    "release_date": "2016-05-15",
    "vote_average": 7.118,
    "Genre": "Comedy"
  }
]