[
  {
    "title": "Your Name.",
    "id": 372058,
    "overview": "High schoolers Mitsuha and Taki are complete strangers living separate lives. But one night, they suddenly switch places. Mitsuha wakes up in Taki’s body, and he in hers. This bizarre occurrence continues to happen randomly, and the two must adjust their lives around each other.",
    "poster_path": "https://image.tmdb.org/t/p/w500/vfJFJPepRKapMd5G2ro7klIRysq.jpg",
    "release_date": "2016-08-26",
    "vote_average": 8.488,
    "Genre": "Anime"
  },
  {
    "title": "Puss in Boots: The Last Wish",
    "id": 315162,
    "overview": "Puss in Boots discovers that his passion for adventure has taken its toll: He has burned through eight of his nine lives, leaving him with only one life left. Puss sets out on an epic journey to find the mythical Last Wish and restore his nine lives.",
    "poster_path": "https://image.tmdb.org/t/p/w500/kuf6dutpsT0vSVehic3EZIqkOBt.jpg",
    "release_date": "2022-12-07",
    "vote_average": 8.226,
    "Genre": "Animation"
  },
  {
    "title": "Deadpool \u0026 Wolverine",
    "id": 533535,
    "overview": "A listless Wade Wilson toils away in civilian life with his days as the morally flexible mercenary, Deadpool, behind him. But when his homeworld faces an existential threat, Wade must reluctantly suit-up again with an even more reluctant Wolverine.",
    "poster_path": "https://image.tmdb.org/t/p/w500/8cdWjvZQUExUUTzyp4t6EDMubfO.jpg",
    "release_date": "2024-07-24",
    "vote_average": 7.757,
    "Genre": "Action"
  },
  {
    "title": "The King's Speech",
    "id": 45269,
    "overview": "The King's Speech tells the story of the man who became King George VI, the father of Queen Elizabeth II. After his brother abdicates, George ('Bertie') reluctantly assumes the throne. Plagued by a dreaded stutter and considered unfit to be king, Bertie engages the help of an unorthodox speech therapist named Lionel Logue. Through a set of unexpected techniques, and as a result of an unlikely friendship, Bertie is able to find his voice and boldly lead the country into war.",
    "poster_path": "https://image.tmdb.org/t/p/w500/uQ538BfYLDJh3GXlzRZLo0j7PFj.jpg",
    "release_date": "2010-11-26",
    "vote_average": 7.7,
    "Genre": "Drama"
  },
  {
    "title": "Dude, Where's My Car?",
    "id": 8859,
    "overview": "Two stoners wake up after a night of partying and cannot remember where they parked their car.",
    "poster_path": "https://image.tmdb.org/t/p/w500/tc6sLnnaOZk08YndHd53aPlUast.jpg",
    "release_date": "2000-12-15",
    "vote_average": 5.539,
    "Genre": "Comedy"
  },
  {
    "title": "The Disaster Artist",
    "id": 371638,
    "overview": "An aspiring actor in Hollywood meets an enigmatic stranger by the name of Tommy Wiseau, the meeting leads the actor down a path nobody could have predicted; creating the worst movie ever made.",
    "poster_path": "https://image.tmdb.org/t/p/w500/jj84nF5vYRD0HUTowBKcrKk8hZP.jpg",
    "release_date": "2017-03-12",
    "vote_average": 7.113,
    "Genre": "Random"
  },
  {
    "title": "The Room",
    "id": 17473,
    "overview": "Johnny is a successful banker with great respect for and dedication to the people in his life, especially his future wife Lisa. The happy-go-lucky guy sees his world being torn apart when his friends begin to betray him one-by-one.",
    "poster_path": "https://image.tmdb.org/t/p/w500/9QscHN4pXj6Ja1k7e1ZT4vWDGnr.jpg",
    "release_date": "2003-06-27",
    "vote_average": 4,
    "Genre": "Weird"
  },
  {
    "title": "Fly Me to the Moon",
    "id": 956842,
    "overview": "Sparks fly in all directions as marketing maven Kelly Jones, brought in to fix NASA's public image, wreaks havoc on Apollo 11 launch director Cole Davis' already difficult task of putting a man on the moon. When the White House deems the mission too important to fail, Jones is directed to stage a fake moon landing as backup, and the countdown truly begins.",
    "poster_path": "https://image.tmdb.org/t/p/w500/gjk8YdXpItoC1in53FCrZMFIuBx.jpg",
    "release_date": "2024-07-10",
    "vote_average": 6.992,
    "Genre": "Last Weeks Winner"
  },
  {
    "title": "Mamma Mia! Here We Go Again",
    "id": 458423,
    "overview": "Five years after meeting her three fathers, Sophie Sheridan prepares to open her mother’s hotel. In 1979, young Donna Sheridan meets the men who each could be Sophie’s biological father.",
    "poster_path": "https://image.tmdb.org/t/p/w500/aWicerX4Y7n7tUwRAVHsVcBBpj2.jpg",
    "release_date": "2018-07-09",
    "vote_average": 7.108,
    "Genre": ""
  }
]